app/controllers/applicants_controller.rb

  def apply
    @job = Job.find params[:id]
    if request.post? && !params[:user].blank?
      @params = params[:user]
      applicant = Applicant.find_by_email_and_job_id(params[:user][:email], @job.id) if params[:user][:email]
      if applicant.blank?
        applicant = Applicant.new(params[:user])
        applicant.job = @job
        if applicant.save
---
SELECT `applicants`.* FROM `applicants` WHERE `applicants`.`email` = 'raxeekh@gmail.com' AND `applicants`.`job_id` = 1 LIMIT 1
INSERT INTO `applicants` (`available_at`, `cgpa`, `cover_letter`, `created_at`, `dob`, `education`, `email`, `expected_salary`, `experience`, `experience_description`, `full_name`, `institute_name`, `job_id`, `languages`, `phone`, `resume`, `status`, `updated_at`) VALUES ('2014-07-31', 3.4, ' \r\n None', '2014-07-09 10:29:36', '1996-07-10', 'BSCS', 'raxeekh@gmail.com', '50,000', 'None', 'None \r\n ', 'Razee Ullah Khan Fayyaz', 'FAST-NU', 1, 'Rails', '03215250000', 'MWME-Policy--RazeeFayyaz.pdf', 'not_reviewed', '2014-07-09 10:29:36')